---
kind: method
id: M:Autodesk.Revit.DB.Electrical.VoltageTypeSet.Clear
source: html/e7480d53-ada7-69de-4ab7-d28e56d83e9d.htm
---
# Autodesk.Revit.DB.Electrical.VoltageTypeSet.Clear Method

Removes every voltage type from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```